#include"ModalMode.h"

ModalMode stoneModes[] =
{
	// frequency, amplitude, decayTime, phase, startSec, gain
	{ 400.0f,   1.0f, 0.20f, 0.0f, 0.0f, 1.00f }, // 低い鈍い衝撃成分
	{ 950.0f,   0.7f, 0.35f, 0.0f, 0.0f, 0.80f }, // 主要な「カツッ」帯域
	{ 1800.0f,  0.5f, 0.32f, 0.0f, 0.0f, 0.70f }, // 石の高域
	{ 2600.0f,  0.3f, 0.25f, 0.0f, 0.0f, 0.60f }, // パキッ感
	{ 4200.0f,  0.2f, 0.15f, 0.0f, 0.0f, 0.40f }, // 高音の残響(表面)
};

ModalMode leatherShoeModes[] =
{
	// frequency, amplitude, decayTime, phase, startSec, gain
	{ 160.0f,  1.0f, 0.08f, 0.0f, 0.0f, 1.00f }, // 低域のボディ衝撃
	{ 450.0f,  0.9f, 0.05f, 0.0f, 0.0f, 0.90f }, // 革靴のメイン音
	{ 780.0f,  0.6f, 0.03f, 0.0f, 0.0f, 0.70f }, // 材質(革)由来の中域
	{ 1300.0f, 0.3f, 0.02f, 0.0f, 0.0f, 0.50f }, // ヒール先端の軽い衝撃
	{ 2500.0f, 0.15f,0.015f,0.0f, 0.0f, 0.25f }, // ほぼすぐ消える高域
};

ModalMode caveRockModes[] =
{
	// --- 基本のアタック（足音の本体） ---
	{ 280.0f,  0.55f, 0.03f, 0.0f, 0.0f, 0.55f },   // 重すぎず軽すぎず
	 // --- 靴と岩の接触音（中域） ---
	{ 520.0f,  0.75f, 0.025f,0.0f, 0.0f, 0.75f },   // これが主要音
	// --- 岩の硬さ（少量の倍音） ---
	{ 900.0f,  0.35f, 0.02f, 0.0f, 0.0f, 0.30f },   // 倍音は控えめ
	// --- 高域はほぼ消す（無機質化） ---
	{ 1400.0f, 0.10f, 0.015f,0.0f, 0.0f, 0.15f },  // ほぼ聞こえない程度
};